content/posts/On_the_Classification_of_Dynamical_Systems_by_Chris_Zeeman_in_1988.md
+++
title = "On the Classification of Dynamical Systems by Chris Zeeman in 1988"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:32-04:00
slug = "On_the_Classification_of_Dynamical_Systems_by_Chris_Zeeman_in_1988"
draft = false
+++

## One is emboldened to ****raise the question of classifying all ordinary differential equations****. Of course, such a task is impossible because it is too complicated, so perhaps we should first try and classify the 'generic' ones. Since any higher order equation can be written as a first order equation on a higher dimensional manifold ****the problem reduces to the classification of vector fields on a manifold****. So let V denote the space of smooth vector fields on a manifold X. ****What should a classification programme consist of?**** We suggest four steps: {#one-is-emboldened-to-raise-the-question-of-classifying-all-ordinary-differential-equations-dot-of-course-such-a-task-is-impossible-because-it-is-too-complicated-so-perhaps-we-should-first-try-and-classify-the-generic-ones-dot-since-any-higher-order-equation-can-be-written-as-a-first-order-equation-on-a-higher-dimensional-manifold-the-problem-reduces-to-the-classification-of-vector-fields-on-a-manifold-dot-so-let-v-denote-the-space-of-smooth-vector-fields-on-a-manifold-x-dot-what-should-a-classification-programme-consist-of-we-suggest-four-steps}


### 1. Choose an equivalence relation on V, and define a vector field to be stable if it has a neighbourhood of equivalents in V. {#1-dot-choose-an-equivalence-relation-on-v-and-define-a-vector-field-to-be-stable-if-it-has-a-neighbourhood-of-equivalents-in-v-dot}


### 2. Prove that the stables are dense in V. {#2-dot-prove-that-the-stables-are-dense-in-v-dot}


### 3. Classify the stable classes. {#3-dot-classify-the-stable-classes-dot}


### 4. Classify the unstable classes of codimension 1,2,..., etc. {#4-dot-classify-the-unstable-classes-of-codimension-1-2-dot-dot-dot-etc-dot}


## [structural stability]({{< relref "structural_stability" >}}) {#structural-stability--structural-stability-dot-md}
